(01) how to find the version

In [ ]:
import pandas as pd
pd.__version__

'2.3.3'

(02) - make a dataframe

In [ ]:
df = pd.DataFrame({'A col':[1,2,3],'B col':[4,5,6]})
df.head()

   A col  B col
0      1      4
1      2      5
2      3      6

In [ ]:
# numpy array use to create dataframe
import numpy as np
arr = np.array([[1,2,3], [4,5,6], [7,8,9]])
df = pd.DataFrame(arr)
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [ ]:
# numpy array dataframe
pd.DataFrame(np.random.rand(4,8))

,0,1,2,3,4,5,6,7
0,0.437618,0.806042,0.095559,0.739415,0.514861,0.372373,0.214674,0.782749
1,0.414834,0.902104,0.915373,0.275214,0.346303,0.502279,0.709384,0.971421
2,0.703768,0.573255,0.366109,0.421221,0.387421,0.354989,0.709486,0.389932
3,0.404075,0.450854,0.127934,0.780441,0.121313,0.210520,0.963089,0.893548

In [ ]:
pd.DataFrame(np.random.rand(2,8), columns=list('ABCDEFGH'))

,A,B,C,D,E,F,G,H
0,0.414848,0.686287,0.405839,0.069239,0.477902,0.979616,0.281249,0.382430
1,0.745480,0.173897,0.362450,0.357174,0.187989,0.354155,0.283209,0.420261

(03)- how to rename columns?

In [ ]:
df = pd.DataFrame({'A col':[1,2,3],'B col':[4,5,6]})
df

   A col  B col
0      1      4
1      2      5
2      3      6

In [ ]:
df.rename(columns = {'A col': 'col_a', 'B col':'col_b'}, inplace=True)
df

   col_a  col_b
0      1      4
1      2      5
2      3      6

In [ ]:

df.columns = ['col_aa', 'col_bb']
df

   col_aa  col_bb
0       1       4
1       2       5
2       3       6

In [ ]:
# to replace any character, string
df.columns = df.columns.str.replace('aa', '_a')

In [ ]:
# adding prefix to columns
df.add_prefix('baba_')
df

   col__a  col_bb
0       1       4
1       2       5
2       3       6

In [ ]:
# adding suffix to columns
df.add_suffix('_baba')

   col__a_baba  col_bb_baba
0            1            4
1            2            5
2            3            6

In [ ]:
df.columns = ['col_a', 'col_b']
df

   col_a  col_b
0      1      4
1      2      5
2      3      6

04 using template data

In [ ]:
import pandas as pd
import numpy as np
import seaborn as sns

df = sns.load_dataset('tips')
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [ ]:
# summary
df.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [ ]:
# columns names
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [ ]:
# saving a dataset
df.to_csv('tips_save.csv')
df.to_excel('tips_save.xlsx')

05- using your own data

In [ ]:
import pandas as pd
df =pd.read_csv('tips_save.csv')
df.head()

   Unnamed: 0  total_bill   tip     sex smoker  day    time  size
0           0       16.99  1.01  Female     No  Sun  Dinner     2
1           1       10.34  1.66    Male     No  Sun  Dinner     3
2           2       21.01  3.50    Male     No  Sun  Dinner     3
3           3       23.68  3.31    Male     No  Sun  Dinner     2
4           4       24.59  3.61  Female     No  Sun  Dinner     4

In [ ]:
df =pd.read_excel('tips_save.xlsx')
df.head()

   Unnamed: 0  total_bill   tip     sex smoker  day    time  size
0           0       16.99  1.01  Female     No  Sun  Dinner     2
1           1       10.34  1.66    Male     No  Sun  Dinner     3
2           2       21.01  3.50    Male     No  Sun  Dinner     3
3           3       23.68  3.31    Male     No  Sun  Dinner     2
4           4       24.59  3.61  Female     No  Sun  Dinner     4

06-reverse row order

In [ ]:
import seaborn as sns
import pandas as pd

df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [ ]:
df.loc[::-1].head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True

07-reverse columns order

In [ ]:
df.loc[:, :: -1].head()

,alone,alive,embark_town,deck,adult_male,who,class,embarked,fare,parch,sibsp,age,sex,pclass,survived
0,False,no,Southampton,NaN,True,man,Third,S,7.2500,0,1,22.0,male,3,0
1,False,yes,Cherbourg,C,False,woman,First,C,71.2833,0,1,38.0,female,1,1
2,True,yes,Southampton,NaN,False,woman,Third,S,7.9250,0,0,26.0,female,3,1
3,False,yes,Southampton,C,False,woman,First,S,53.1000,0,1,35.0,female,1,1
4,True,no,Southampton,NaN,True,man,Third,S,8.0500,0,0,35.0,male,3,0

08-select a columns by dtype

In [ ]:
df.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [ ]:
# only select those have numeric types
df.select_dtypes(include=['object']).head()

      sex embarked    who  embark_town alive
0    male        S    man  Southampton    no
1  female        C  woman    Cherbourg   yes
2  female        S  woman  Southampton   yes
3  female        S  woman  Southampton   yes
4    male        S    man  Southampton    no

In [ ]:
# only select those have object types
df.select_dtypes(include=['number']).head()

   survived  pclass   age  sibsp  parch     fare
0         0       3  22.0      1      0   7.2500
1         1       1  38.0      1      0  71.2833
2         1       3  26.0      0      0   7.9250
3         1       1  35.0      1      0  53.1000
4         0       3  35.0      0      0   8.0500

In [ ]:
df.select_dtypes(exclude=['object']).head()

,survived,pclass,age,sibsp,parch,fare,class,adult_male,deck,alone
0,0,3,22.0,1,0,7.2500,Third,True,NaN,False
1,1,1,38.0,1,0,71.2833,First,False,C,False
2,1,3,26.0,0,0,7.9250,Third,False,NaN,True
3,1,1,35.0,1,0,53.1000,First,False,C,False
4,0,3,35.0,0,0,8.0500,Third,True,NaN,True

09- convert string to number

In [ ]:
df=pd.DataFrame({'col_A':[1, 2, 3, 6, 7, 8, 9, 22],'col_B':[4, 5, 6, 7, 8, 9, 10, 11]})
df

   col_A  col_B
0      1      4
1      2      5
2      3      6
3      6      7
4      7      8
5      8      9
6      9     10
7     22     11

In [ ]:
df.dtypes

col_A    int64
col_B    int64
dtype: object

In [ ]:
df.astype({'col_A':'int64', 'col_B':'int64'}).dtypes

col_A    int64
col_B    int64
dtype: object

In [ ]:
pd.to_numeric(df['col_A'],errors='coerce')

0     1
1     2
2     3
3     6
4     7
5     8
6     9
7    22
Name: col_A, dtype: int64

10-reduce dataframe size

In [ ]:
df=sns.load_dataset('titanic')
df.shape

(891, 15)

11-copy data from clipboard

In [ ]:
# dataset download
import seaborn as sns
import pandas as pd

df = sns.load_dataset('titanic')
df.to_excel('kashti.xlsx')

In [ ]:
# read clipboard in python
df = pd.read_clipboard()
df
df.to_csv('excel ka data.csv')

12-split dataframe into two subsets

In [ ]:
# dataset download
import seaborn as sns
import pandas as pd

df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [ ]:
len(df)

891

In [ ]:
df.shape

(891, 15)

In [ ]:
kashti_1 = df.sample(frac=0.50, random_state=1)
kashti_1.shape

(446, 15)

In [ ]:
kashti_2 = df.drop(kashti_1.index)
kashti_2.shape

(445, 15)

In [ ]:
kashti_1.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
862,1,1,female,48.0,0,0,25.9292,S,First,woman,False,D,Southampton,yes,True
223,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
84,1,2,female,17.0,0,0,10.5000,S,Second,woman,False,NaN,Southampton,yes,True
680,0,3,female,NaN,0,0,8.1375,Q,Third,woman,False,NaN,Queenstown,no,True
535,1,2,female,7.0,0,2,26.2500,S,Second,child,False,NaN,Southampton,yes,False

In [ ]:
kashti_2.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
15,1,2,female,55.0,0,0,16.0000,S,Second,woman,False,NaN,Southampton,yes,True
18,0,3,female,31.0,1,0,18.0000,S,Third,woman,False,NaN,Southampton,no,False

In [ ]:
df.shape

(891, 15)

In [ ]:
len(kashti_1) + len(kashti_2)

891

13- join two datsets

In [ ]:
df1 = pd.concat([kashti_1, kashti_2])
df1.shape

(891, 15)

14- filtering a datsets

In [ ]:
df.head()

   A col  B col
0      1      4
1      2      5
2      3      6